fio/results/libpmem_d32_test.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=2): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=3): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
[...]

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=46296: Thu Jun 14 13:15:01 2018
   read: IOPS=8344k, BW=31.8GiB/s (34.2GB/s)(955GiB/30001msec)
    clat (nsec): min=101, max=36023k, avg=3171.82, stdev=113255.37
     lat (nsec): min=125, max=36023k, avg=3245.45, stdev=114555.06
    clat percentiles (nsec):
     |  1.00th=[  836],  5.00th=[ 1272], 10.00th=[ 1512], 20.00th=[ 1800],
     | 30.00th=[ 2008], 40.00th=[ 2192], 50.00th=[ 2352], 60.00th=[ 2512],
     | 70.00th=[ 2704], 80.00th=[ 2896], 90.00th=[ 3248], 95.00th=[ 3536],
     | 99.00th=[ 4320], 99.50th=[ 4704], 99.90th=[ 5856], 99.95th=[14656],
     | 99.99th=[17280]
   bw (  KiB/s): min=398537, max=1380749, per=2.50%, avg=834990.52, stdev=226834.64, samples=1888
   iops        : min=99634, max=345188, avg=208747.26, stdev=56708.67, samples=1888
  lat (nsec)   : 250=0.08%, 500=0.20%, 750=0.39%, 1000=1.30%
  lat (usec)   : 2=27.77%, 4=68.33%, 10=1.87%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=74.99%, sys=0.00%, ctx=17580, majf=0, minf=2381
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=250336677,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=46339: Thu Jun 14 13:15:01 2018
  write: IOPS=6583k, BW=25.1GiB/s (26.0GB/s)(753GiB/30001msec)
    clat (nsec): min=309, max=115992k, avg=4268.53, stdev=130966.14
     lat (nsec): min=339, max=115992k, avg=4330.75, stdev=131939.97
    clat percentiles (nsec):
     |  1.00th=[ 1064],  5.00th=[ 1592], 10.00th=[ 1864], 20.00th=[ 2224],
     | 30.00th=[ 2512], 40.00th=[ 2768], 50.00th=[ 3056], 60.00th=[ 3344],
     | 70.00th=[ 3664], 80.00th=[ 4080], 90.00th=[ 4704], 95.00th=[ 5408],
     | 99.00th=[ 7008], 99.50th=[ 7712], 99.90th=[ 9280], 99.95th=[10048],
     | 99.99th=[12992]
   bw (  KiB/s): min=212917, max=1088863, per=2.69%, avg=708361.51, stdev=194570.65, samples=1888
   iops        : min=53229, max=272215, avg=177089.99, stdev=48642.65, samples=1888
  lat (nsec)   : 500=0.02%, 750=0.25%, 1000=0.53%
  lat (usec)   : 2=12.68%, 4=65.11%, 10=21.35%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=74.99%, sys=0.00%, ctx=17725, majf=0, minf=2411
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,197485150,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=2, jobs=32): err= 0: pid=46371: Thu Jun 14 13:15:01 2018
   read: IOPS=8650k, BW=32.0GiB/s (35.4GB/s)(990GiB/30002msec)
    clat (nsec): min=371, max=96016k, avg=3075.96, stdev=112537.10
     lat (nsec): min=401, max=96016k, avg=3146.87, stdev=113856.02
    clat percentiles (nsec):
     |  1.00th=[  884],  5.00th=[ 1240], 10.00th=[ 1464], 20.00th=[ 1736],
     | 30.00th=[ 1928], 40.00th=[ 2096], 50.00th=[ 2256], 60.00th=[ 2416],
     | 70.00th=[ 2608], 80.00th=[ 2800], 90.00th=[ 3152], 95.00th=[ 3472],
     | 99.00th=[ 4256], 99.50th=[ 4640], 99.90th=[ 5792], 99.95th=[14528],
     | 99.99th=[17024]
   bw (  KiB/s): min=243290, max=1447756, per=2.82%, avg=975554.76, stdev=277735.03, samples=1888
   iops        : min=60822, max=361939, avg=243888.30, stdev=69433.77, samples=1888
  lat (nsec)   : 500=0.01%, 750=0.37%, 1000=1.45%
  lat (usec)   : 2=32.10%, 4=64.38%, 10=1.63%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=74.98%, sys=0.01%, ctx=16998, majf=0, minf=2389
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=259528845,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=3, jobs=32): err= 0: pid=46403: Thu Jun 14 13:15:01 2018
  write: IOPS=6567k, BW=25.1GiB/s (26.9GB/s)(752GiB/30002msec)
    clat (nsec): min=309, max=56009k, avg=4307.30, stdev=131155.42
     lat (nsec): min=340, max=56009k, avg=4369.15, stdev=132056.10
    clat percentiles (nsec):
     |  1.00th=[ 1128],  5.00th=[ 1624], 10.00th=[ 1880], 20.00th=[ 2256],
     | 30.00th=[ 2544], 40.00th=[ 2800], 50.00th=[ 3056], 60.00th=[ 3344],
     | 70.00th=[ 3664], 80.00th=[ 4080], 90.00th=[ 4768], 95.00th=[ 5472],
     | 99.00th=[ 7072], 99.50th=[ 7776], 99.90th=[ 9408], 99.95th=[10176],
     | 99.99th=[13760]
   bw (  KiB/s): min=260544, max=1111904, per=3.12%, avg=820929.36, stdev=223213.20, samples=1889
   iops        : min=65136, max=277976, avg=205232.30, stdev=55803.30, samples=1889
  lat (nsec)   : 500=0.02%, 750=0.19%, 1000=0.44%
  lat (usec)   : 2=12.12%, 4=65.36%, 10=21.80%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=74.99%, sys=0.00%, ctx=18031, majf=0, minf=2437
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,197037447,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.8GiB/s (34.2GB/s), 31.8GiB/s-31.8GiB/s (34.2GB/s-34.2GB/s), io=955GiB (1025GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=25.1GiB/s (26.0GB/s), 25.1GiB/s-25.1GiB/s (26.0GB/s-26.0GB/s), io=753GiB (809GB), run=30001-30001msec

Run status group 2 (all jobs):
   READ: bw=32.0GiB/s (35.4GB/s), 32.0GiB/s-32.0GiB/s (35.4GB/s-35.4GB/s), io=990GiB (1063GB), run=30002-30002msec

Run status group 3 (all jobs):
  WRITE: bw=25.1GiB/s (26.9GB/s), 25.1GiB/s-25.1GiB/s (26.9GB/s-26.9GB/s), io=752GiB (807GB), run=30002-30002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%